In [ ]:
1. Find out how many Male and Female passenger was onboarded.
2. How many survived we have.
3. How many casuality we have.
4. What is a name of a person who has the eldest one.
5. How many passenger do we have in First, Second and Third Class.
6. How many passenger do we have whose name starts with "S".
7. try to create a new column which is the sumation of "SibSp" and "Parch".
8. How many person do we have below age of 25.
9. How many passenger died whose age was less than 40.
10. From a "Cabin" column seperate text and numeric value.

In [1]:
#"https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

In [2]:
import pandas as pd

In [3]:
data=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
# 1. Find out how many Male and Female passenger was onboarded.

In [6]:
len(data[data["Sex"]=="male"])
len(data[data["Sex"]=="female"])

314

In [7]:
data["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [8]:
data.groupby("Sex").count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

In [9]:
data.groupby("Sex")["Sex"].count()

Sex
female    314
male      577
Name: Sex, dtype: int64

In [10]:
# 2. How many survived we have.
data["Survived"].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [11]:
data.groupby("Survived")["Survived"].count()

Survived
0    549
1    342
Name: Survived, dtype: int64

In [12]:
len(data[(data["Survived"]==1)])

342

In [13]:
#3. How many casuality we have.
len(data[(data["Survived"]==0)])

549

In [14]:
#4. What is a name of a person who has the eldest one.
data[["Name","Age"]].max()

Name    van Melkebeke, Mr. Philemon
Age                            80.0
dtype: object

In [17]:
data[data["Age"]==data["Age"].max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [18]:
#5. How many passenger do we have in First, Second and Third Class.
data["Pclass"].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [19]:
data.groupby("Pclass").count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [20]:
data.groupby("Pclass")["Pclass"].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

In [21]:
#6. How many passenger do we have whose name starts with "S".
len(data[data["Name"].str.startswith("S")])
data[data["Name"].str.startswith("S")]
data[data["Name"].str.startswith("S")]["Name"]
#df[df["Name"].str.startswith("S")].value_counts()

10                       Sandstrom, Miss. Marguerite Rut
12                        Saundercock, Mr. William Henry
23                          Sloper, Mr. William Thompson
31        Spencer, Mrs. William Augustus (Marie Eugenie)
48                                   Samaan, Mr. Youssef
                             ...
851                                  Svensson, Mr. Johan
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
863                    Sage, Miss. Dorothy Edith "Dolly"
880         Shelley, Mrs. William (Imanita Parrish Hall)
884                               Sutehall, Mr. Henry Jr
Name: Name, Length: 86, dtype: object

In [22]:
#7. try to create a new column which is the sumation of "SibSp" and "Parch".
data["sum_sibspandParch"]=data["SibSp"]+data["Parch"]

In [23]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sum_sibspandParch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [24]:
#8. How many person do we have below age of 25.

data[data["Age"]<25]
len(data[data["Age"]<25])

278

In [25]:
#9. How many passenger died whose age was less than 40.

#df[(df["Survived"]==0) & (df["Age"]<40)]
len(data[(data["Survived"]==0) & (data["Age"]<40)])

322

In [26]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sum_sibspandParch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [27]:
#10. From a "Cabin" column seperate text and numeric value.

data["Cabin"]

import re
replace=re.compile("([a-zA-Z]+)")

data["string_cabin_list"]=data["Cabin"].str.extract(replace)
data["num_Cabin_list"]=data["Cabin"].str.replace(replace,"")

In [28]:
data["string_cabin_list"]

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: string_cabin_list, Length: 891, dtype: object

In [29]:
data["num_Cabin_list"]

0      NaN
1       85
2      NaN
3      123
4      NaN
      ...
886    NaN
887     42
888    NaN
889    148
890    NaN
Name: num_Cabin_list, Length: 891, dtype: object